//Од тастатура се читаат непознат број позитивни цели броеви се додека не се внесе нешто различно од број. 
//За секој број треба да се пресмета збирот на цифрата со максимална вредност од претходно внесениот број  и сумата на цифрите на тековниот број (за првиот внесен број се пресметува само сумата на неговите цифри). 
//За секој внесен број резултатот треба да се испечати во следниот формат:/

#include <stdio.h>
#include <stdlib.h>

int main() {
    int n, zbir, temp, temp_br;

    while ((scanf("%d", &n)) == 1) {

        zbir = 0;

        while (temp_br != 0) {
            if (temp < temp_br%10) temp = temp_br%10;
            temp_br /= 10;
        }

        temp_br = n;

        while (n != 0) {
            zbir += n%10;
            n /= 10;
        }

        printf("%d: %d", temp_br, zbir + temp);
    }
}
